# taps
tap "homebrew/bundle"

# formulae
brew "git"
brew "git-lfs"
brew "mas"
brew "zoxide"
brew "fzf"
brew "tree"
brew "tldr"
brew "tmux"
brew "screen"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "imagemagick" 
brew "ffmpeg"
brew "mosh"

# casks
cask "1password"
cask "1password-cli"
cask "bartender"
cask "cheatsheet"
cask "microsoft-edge"
cask "slack"
cask "snipaste"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
cask "zotero"
cask "anaconda"
cask "rectangle"
cask "anki"
cask "docker"

# mac apple store
mas "CopyLess 2", id: 993841014
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "QQ", id: 451108668
mas "Reeder", id: 1529448980
mas "Streaks", id: 963034692
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723