# taps
tap "homebrew/bundle"

# formulae
brew "git"
brew "git-lfs"
brew "lazygit"
brew "mas"
brew "zoxide"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "tree"
brew "tldr"
brew "tmux"
brew "screen"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "imagemagick" 
brew "ffmpeg"
brew "mosh"
brew "pandoc"
brew "yazi"
brew "poppler"
brew "7-zip"
brew "jq"
brew "resvg"

# casks
cask "1password"
cask "1password-cli"
cask "bartender"
cask "cheatsheet"
cask "microsoft-edge"
cask "slack"
cask "snipaste"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
cask "zotero"
cask "anaconda"
cask "rectangle"
cask "docker"
cask "tev"
cask "eudic"
cask "folo"
cask "copilot-cli"
cask "ghostty"
cask "iina"

# mac apple store
mas "CopyLess 2", id: 993841014
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Microsoft Outlook", id: 985367838
mas "OneDrive", id: 823766827
mas "QQ", id: 451108668
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723