# formulae
brew "git"
brew "git-lfs"
brew "lazygit"
brew "zoxide"
brew "eza"
brew "bat"
brew "uv"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "tree"
brew "tldr"
brew "tmux"
brew "screen"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "imagemagick" 
brew "ffmpeg"
brew "mosh"
brew "pandoc"
brew "yazi"
brew "poppler"
brew "7-zip"
brew "jq"
brew "resvg"
